# Project: Building MySQL Database for VHS Rental Store | Cristiane Carneiro

## Data Cleaning : rental.csv

In this file, one can review the step by step cleaning process for table rental.csv

### Import

We start by importing the libraries we are going to use and loading the database

In [1]:
%pip install ipython
%pip install seaborn
%pip install mysql-connector-python
%pip install sqlalchemy
%pip install pymysql

Requirement already satisfied: ipython in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (8.16.1)
Requirement already satisfied: backcall in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (0.2.0)
Requirement already satisfied: decorator in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (0.19.1)
Requirement already satisfied: matplotlib-inline in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (0.1.6)
Requirement already satisfied: pickleshare in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (3.0.39)
Requirement already satisfied: pygments>=2.4.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (2.16.1)
Requirement already satisfied: stack-data in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (0.6.3)
Requirement already satisfied: traitlets>=5 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (5.11.2)
Requirement already satisfied: exceptiongroup in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (1.1.3)
Requirement already satisfied: pexpect>4.3 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (4.8.0)
Requirement already satisfied: appnope in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (0.1.3)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from jedi>=0.16->ipython) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from pexpect>4.3->ipython) (0.7.0)
Requirement already satisfied: wcwidth in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30->ipython) (0.2.8)
Requirement already satisfied: executing>=1.2.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from stack-data->ipython) (2.0.0)
Requirement already satisfied: asttokens>=2.1.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from stack-data->ipython) (2.4.0)
Requirement already satisfied: pure-eval in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from stack-data->ipython) (0.2.2)
Requirement already satisfied: six>=1.12.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from asttokens>=2.1.0->stack-data->ipython) (1.16.0)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: seaborn in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (0.13.0)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from seaborn) (1.26.1)
Requirement already satisfied: pandas>=1.2 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from seaborn) (2.1.1)
Requirement already satisfied: matplotlib!=3.6.1,>=3.3 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from seaborn) (3.8.0)
Requirement already satisfied: contourpy>=1.0.1 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (1.1.1)
Requirement already satisfied: cycler>=0.10 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (4.43.1)
Requirement already satisfied: kiwisolver>=1.0.1 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (1.4.5)
Requirement already satisfied: packaging>=20.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (23.2)
Requirement already satisfied: pillow>=6.2.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (10.1.0)
Requirement already satisfied: pyparsing>=2.3.1 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (3.1.1)
Requirement already satisfied: python-dateutil>=2.7 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from pandas>=1.2->seaborn) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from pandas>=1.2->seaborn) (2023.3)
Requirement already satisfied: six>=1.5 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.3->seaborn) (1.16.0)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: mysql-connector-python in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (8.2.0)
Requirement already satisfied: protobuf<=4.21.12,>=4.21.1 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from mysql-connector-python) (4.21.12)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: sqlalchemy in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (2.0.22)
Requirement already satisfied: typing-extensions>=4.2.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from sqlalchemy) (4.8.0)
Requirement already satisfied: greenlet!=0.4.17 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from sqlalchemy) (3.0.1)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: pymysql in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
pd.set_option('display.max_columns', None)

import numpy as np

import warnings
warnings.filterwarnings('ignore')

import pylab as plt  

import seaborn as sns 

import mysql.connector as conn

from sqlalchemy import create_engine

%matplotlib inline

In [3]:
rental = pd.read_csv('/Users/criscarneiro/desktop/ironhack/6_Projects/sql-data-base-building/data/raw/rental.csv')

In [4]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

### Good practices

Some good practices before we continue with the exercise

In [5]:
#creating a back-up with the original table 

rentaloriginal = rental.copy()

In [6]:
#ensuring column names are clean 

rental.columns

Index(['rental_id', 'rental_date', 'inventory_id', 'customer_id',
       'return_date', 'staff_id', 'last_update'],
      dtype='object')

In [7]:
rental.columns = [c.lower().replace(' ', '_') for c in rental.columns]

rental.columns

Index(['rental_id', 'rental_date', 'inventory_id', 'customer_id',
       'return_date', 'staff_id', 'last_update'],
      dtype='object')

In [8]:
#checking for duplicates 

rental.duplicated().any() #there are no duplicates

False

### Explore

Exploratory analysis to understand the data base (e.g,. description, column types, searching for null values)

In [9]:
#it seems we have a repository of actors with their respective IDs and the data in each it was updated. 

rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [10]:
#we have 7 columns, and 1000 entries (rows) in our original database

rentaloriginal.shape

(1000, 7)

In [11]:
#here we can see the type of each of the columns
#it seems all values are non-null

rental.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 54.8+ KB

In [12]:
#description table 

rental.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
rental_id,1000.0,NaN,NaN,NaN,501.18,289.19665,1.0,250.75,501.5,751.25,1001.0
rental_date,1000,999,2005-05-30 14:47:31,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
inventory_id,1000.0,NaN,NaN,NaN,2258.179,1314.667454,2.0,1157.5,2244.5,3371.75,4581.0
customer_id,1000.0,NaN,NaN,NaN,296.408,172.509319,1.0,150.0,296.0,445.25,597.0
return_date,1000,997,2005-06-05 15:16:54,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
staff_id,1000.0,NaN,NaN,NaN,1.521,0.499809,1.0,1.0,2.0,2.0,2.0
last_update,1000,1,2006-02-15 21:30:53,1000,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Null values

As stated above, there are no null values in the database. See per below:

In [13]:
#there are no null values in the database 

nan_cols = rental.isna().sum()

nan_cols

rental_id       0
rental_date     0
inventory_id    0
customer_id     0
return_date     0
staff_id        0
last_update     0
dtype: int64

### Other cleaning

#### rental_id

In [14]:
#we got a list of int values, which seem to be IDs for the each rental 
#this is the most appropriate datatype, although will optimize it later 

rental.rental_id.dtype

dtype('int64')

In [15]:
#it seems all the IDs are unique values 

len(rental.rental_id.unique())

1000

In [16]:
#the IDs are numbers from 1 through 1001

#rental.rental_id.unique()

#### rental_date

In [17]:
#this column is type 'object'. It seems tough it would be most appropriate as a 'time type'

rental.rental_date.dtype

dtype('O')

In [18]:
#values are date, time

rental.rental_date[0]

'2005-05-24 22:53:30'

In [19]:
#I will convert the data to datetime64

rental.rental_date = pd.to_datetime(rental.rental_date)

In [20]:
#converted 

rental.rental_date.dtype

dtype('<M8[ns]')

#### inventory_id

In [21]:
#we got a list of int values, which seem to be linked to the inventory table
#this is the most appropriate datatype, although will optimize it later 

rental.inventory_id.dtype

dtype('int64')

In [22]:
#it seems there are 1000 unique values, consistent with the inventory_id from inventory table
#however, while in the inventory table the inventory_id varies from 1 through 1000, here it seems we got values from 2 through 4581

print(len(rental.inventory_id.unique()))
print(rental.inventory_id.min())
print(rental.inventory_id.max())

1000
2
4581

In [23]:
#for the purpose of this exercise, I want to connect tables Rental & Inventory via inventory_id as a foreign key.
#therefore, I will disregard any values in the table rental which IDs are > 1000 

bad_index = rental[rental.inventory_id>1000].index

In [24]:
rental.drop(bad_index, axis=0, inplace=True)

#### customer_id

In [25]:
#we got a list of int values with customer id values
#this is the most appropriate datatype, although will optimize it later 

rental.customer_id.dtype

dtype('int64')

In [26]:
#175 unique customers left

len(rental.customer_id.unique())

175

#### return_date

In [27]:
#this column is type 'object'. It seems tough it would be most appropriate as a 'time type'

rental.return_date.dtype

dtype('O')

In [28]:
#values are date, time

rental.return_date[0]

'2005-05-26 22:04:30'

In [29]:
#I will convert the data to datetime64

rental.return_date = pd.to_datetime(rental.return_date)

In [30]:
#converted 

rental.return_date.dtype

dtype('<M8[ns]')

#### staff_id

In [31]:
#we got a list of int values with staff id values
#this is the most appropriate datatype, although will optimize it later 

rental.staff_id.dtype

dtype('int64')

In [32]:
#2 unique staff

len(rental.staff_id.unique())

2

#### last_update

In [33]:
#this column is type 'object'. It seems tough it would be most appropriate as a 'time type'

rental.last_update.dtype

dtype('O')

In [34]:
#all the values are the same, indicating all the names were last updated on Feb 15th 2006 21:30

rental.last_update.value_counts()

last_update
2006-02-15 21:30:53    212
Name: count, dtype: int64

In [35]:
#I will convert the data to datetime64

rental.last_update = pd.to_datetime(rental.last_update)

In [36]:
#converted 

rental.last_update.dtype

dtype('<M8[ns]')

### Column names and duplicates

In [37]:
rental.columns

Index(['rental_id', 'rental_date', 'inventory_id', 'customer_id',
       'return_date', 'staff_id', 'last_update'],
      dtype='object')

In [38]:
#renaming last_update to distinguish from other tables, renaming inventory_column to keep an eye on it

newcolumns = ['rental_id', 'rental_date', 'inventory_id', 'customer_id','return_date', 'staff_id', 'rental_last_update']

In [39]:
rental.columns = newcolumns

In [40]:
#checking for duplicates 

rental.duplicated().any() #there are no duplicates

False

In [41]:
rental.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,rental_last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
15,16,2005-05-25 00:43:11,389,316,2005-05-26 04:42:11,2,2006-02-15 21:30:53

### Column types and optimization

I will optimize the database for memory

In [42]:
rental.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
Index: 212 entries, 0 to 993
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   rental_id           212 non-null    int64
 1   rental_date         212 non-null    datetime64[ns]
 2   inventory_id        212 non-null    int64
 3   customer_id         212 non-null    int64
 4   return_date         212 non-null    datetime64[ns]
 5   staff_id            212 non-null    int64
 6   rental_last_update  212 non-null    datetime64[ns]
dtypes: datetime64[ns](3), int64(4)
memory usage: 21.4 KB

In [43]:
#downcast int

for c in rental.select_dtypes('integer'):
    
    rental[c] = pd.to_numeric(rental[c], downcast='integer')

In [44]:
#no need for 'nanoseconds' precision

for c in rental.select_dtypes('datetime64[ns]'):

    rental[c] = rental[c].astype('datetime64[s]')

### Comparison output vs. original

In [45]:
#droped rows which inventory_id > 1000 

print(rentaloriginal.shape)
print(rental.shape)

(1000, 7)
(212, 7)

In [46]:
rental.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
Index: 212 entries, 0 to 993
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   rental_id           212 non-null    int16
 1   rental_date         212 non-null    datetime64[s]
 2   inventory_id        212 non-null    int16
 3   customer_id         212 non-null    int16
 4   return_date         212 non-null    datetime64[s]
 5   staff_id            212 non-null    int8
 6   rental_last_update  212 non-null    datetime64[s]
dtypes: datetime64[s](3), int16(3), int8(1)
memory usage: 16.2 KB

In [47]:
rentaloriginal.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 254.0 KB

### Export clean table

In [48]:
rental.to_csv('/Users/criscarneiro/desktop/ironhack/6_Projects/sql-data-base-building/data/clean/rental_clean.csv', index=False)

### Export to MYSQL

In [49]:
with open('/Users/criscarneiro/desktop/ironhack/6_Projects/sql-data-base-building/pw.txt') as file: 
    
    password = file.read()

In [50]:
str_conn=f'mysql+pymysql://root:{password}@localhost:3306/rentalstore'

cursor = create_engine(str_conn)

In [51]:
rental.to_sql(name='rental',
              con=cursor,
              if_exists = 'replace',
              index=True)

212